#### TriangulationInterfaceForTriangulatedShellComponent Members

---

|  |
| --- |
| TriangulationInterfaceForTriangulatedShellComponent Class   Constructors   Methods   Properties   See Also |

The  TriangulationInterfaceForTriangulatedShellComponent  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | TriangulationInterfaceForTriangulatedShellComponent | Constructs an interface object for a TriangulatedShellComponent. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  TriangulationInterface  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  TriangulationInterface  .) |

# See Also

TriangulationInterfaceForTriangulatedShellComponent Class

Autodesk.Revit.DB Namespace